In [2]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [3]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

'Connected: root@bank'

> Purpose: The purpose of this lesson is to dive deeper in subqueries - how to use the self-contained subqueries with the `WHERE` clause with the different operators, including the `IN` operator and comparison operator. We will also talk in more detail about other clauses that can be used with nesting, including `HAVING`, `SELECT` and `FROM`.

After this lesson, students will be able to:

- Write self-contained subqueries using the `WHERE` clause along with the `IN` and comparison operators.
- Use subqueries with other clauses including `HAVING`, `SELECT` and `FROM`.
- Interpret the logical order of processing for subqueries.

## **Lesson 1**
- Subqueries with the `WHERE` clause
- Using comparison operators: Comparison with a single value

#### This is a simple example where we are trying to show how subqueries are used. The same could also be achieved by using `HAVING` clause and no subquery:

In [7]:
%%sql
select * from (
  select account_id, bank_to, account_to, sum(amount) as Total
  from bank.order
  group by account_id, bank_to, account_to
) sub1
where total > 10000
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(26, 'EF', 12891853, 10387.0),
 (31, 'ST', 42430687, 10202.0),
 (84, 'ST', 18454540, 12452.0),
 (212, 'EF', 58462047, 13841.0),
 (257, 'GH', 22533124, 14166.0)]

#### Sample A: The result from this query will be used again in later session to build further in the other topic we will cover:

In [8]:
%%sql
select bank from (
  select bank, avg(amount) as Average
  from bank.trans
  where bank <> ''
  group by bank
  having Average > 5500) sub1
limit 5;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[('ST',), ('UV',), ('GH',)]


In this query we are trying to find those banks from the `trans` table where the average amount of transactions is over 5500.

If we try to find this result directly, it would not be possible as we need only the names of the banks and not the averages in this case.

#### **Sample B : The result from this query will be used again in later session to build further in the other topic we will cover**

In [9]:
%%sql
select k_symbol from (
  select avg(amount) as Average, k_symbol
  from bank.order
  where k_symbol <> ' '
  group by k_symbol
  having Average > 3000
  order by Average desc
) sub1;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[('UVER',), ('SIPO',)]

In this query we are trying to find the `k_symbols` based on the average amount from the table `order`. The average amount should be more than 3000.

# 3.05 Activity 1

Keep working on the `bank` database.

Find out the average number of transactions by account. Get those accounts that have more transactions than the average.

### Solution:

In [46]:
%%sql
select a.*, count(t.trans_id) num_trans
from bank.account a
join bank.trans t
using (account_id)
group by account_id
having count(t.trans_id) > (
  select avg(num_trans) as avg_num_trans
  from (
    select account_id, count(trans_id) num_trans
    from bank.trans
    group by account_id
  ) t
) 
order by account_id
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 18, 'POPLATEK MESICNE', 950324, 199),
 (2, 1, 'POPLATEK MESICNE', 930226, 374),
 (6, 51, 'POPLATEK MESICNE', 940927, 195),
 (8, 57, 'POPLATEK MESICNE', 950921, 195),
 (9, 70, 'POPLATEK MESICNE', 930127, 324)]

## **Lesson 2**

 #### **1. Sub queries using the `IN` operator: Comparison with a list of values**

In the next query we will use the results from **Sample A**. In that query we found the banks from the `trans` table where the average amount of transactions is over 5500. Now we will use those results to filter the results from the `order` table where `bank_to` is in the list of banks found previously.

In [47]:
%%sql
select * from bank.order
where bank_to in (
  select bank from (
    select bank, avg(amount) as Average
    from bank.trans
    where bank <> ''
    group by bank
    having Average > 5500
    ) sub1
)
and k_symbol <> ' '
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(29402, 2, 'ST', 89597016, 3372.7, 'UVER'),
 (29407, 4, 'UV', 26693541, 2078.0, 'SIPO'),
 (29408, 4, 'UV', 5848086, 1285.0, 'SIPO'),
 (29409, 5, 'GH', 37390208, 2668.0, 'SIPO'),
 (29412, 8, 'UV', 12510681, 2612.0, 'SIPO')]

In this query we will use the results from **Sample B**. In that query we found the `k_symbols` based on the average amount from the table `order`. The average amount was more than 3000. Now we will use the results from this query to only see the transactions from the `trans` table where the `k_symbol` value is the result from the above query.

In [48]:
%%sql
select * from bank.trans
where k_symbol in (
  select k_symbol as symbol from (
    select avg(amount) as Average, k_symbol
    from bank.order
    where k_symbol <> ' '
    group by k_symbol
    having Average > 3000
    order by Average desc
  ) sub1
)
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(695340, 2378, 930207, 'VYDAJ', 'PREVOD NA UCET', 9612.0, 80033.7, 'SIPO', 'EF', 1222903),
 (695341, 2378, 930307, 'VYDAJ', 'PREVOD NA UCET', 9612.0, 47502.8, 'SIPO', 'EF', 1222903),
 (144704, 485, 930308, 'VYDAJ', 'PREVOD NA UCET', 7421.0, 38959.9, 'SIPO', 'EF', 89687889),
 (695342, 2378, 930407, 'VYDAJ', 'PREVOD NA UCET', 9612.0, 24585.6, 'SIPO', 'EF', 1222903),
 (144705, 485, 930408, 'VYDAJ', 'PREVOD NA UCET', 7421.0, 35884.0, 'SIPO', 'EF', 89687889)]

# 3.05 Activity 2

1. Get a list of accounts from Central Bohemia using a subquery.
2. Rewrite the previous as a join query.
3. Discuss which method will be more efficient.

In [50]:
%%sql
-- 1
select * from bank.account
where district_id in (
  select A1 from bank.district
  where A3 = 'central Bohemia'
)
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(3, 5, 'POPLATEK MESICNE', 970707),
 (4, 12, 'POPLATEK MESICNE', 960221),
 (16, 12, 'POPLATEK MESICNE', 970923),
 (29, 7, 'POPLATEK MESICNE', 941124),
 (32, 5, 'POPLATEK MESICNE', 950828)]

In [ ]:
%%sql
-- 2
select a.* from bank.account a
inner join bank.district d on d.A1 = a.district_id
where  d.A3 = 'central Bohemia';
```

## **Lesson 3 Key concepts**

Sub-queries are the logically correct way to solve problems of the form, "Get facts from A, conditional on facts from B". In such instances, it makes more logical sense to stick B in a sub-query than to do a join. It is also safer, in a practical sense, since you don't have to be cautious about getting duplicated facts from A due to multiple matches against B.

Practically speaking, however, the answer usually comes down to performance. Some optimisers perform badly when given a join vs a sub-query, and some do the other way around, and this is optimiser-specific, DBMS-version-specific and query-specific.

Historically, explicit joins usually win, hence the established wisdom that joins are better, but optimisers are getting better all the time, and so I prefer to write queries first in a logically coherent way, and then restructure if performance constraints warrant this.

#### **Some properties/important points on subqueries**

1. A subquery is a `select` statement that is included with another query.
2. Enclose the subquery in parenthesis.
3. A subquery can return a single value, a list of values or a complete table.
4. A subquery can't include an `ORDER BY` clause.
5. There can be many levels of nesting in the subquery.
6. When you use a subquery, its results can't be included in the `SELECT` statement of the main query.

  <summary> Logical order of processing</summary>

1.  `FROM`
2.  `ON`
3.  `JOIN`
4.  `WHERE`
5.  `GROUP BY`
6.  `HAVING`
7.  `SELECT`
8.  `DISTINCT`
9.  `ORDER BY`
10. `LIMIT`

# 3.05 Activity 3

Find the most active customer for each district in Central Bohemia.

### Solution:

In [72]:
%%sql
select account_id, district_id, sum(amount) as total, rank() over (
  partition by district_id
  order by sum(amount) desc
) position
from bank.account
inner join bank.trans
using (account_id)
where district_id in (
  select district_id
  from bank.district
  where A3 = 'central Bohemia'
)
group by account_id
order by district_id desc
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(5228, 77, 5026336.7999687195, 1),
 (299, 77, 4436906.399894714, 2),
 (1000, 77, 3506454.9001255035, 3),
 (1962, 77, 2752995.9999752045, 4),
 (5817, 77, 2353186.6000208855, 5)]

In [69]:
%%sql
select * from (
  select account_id, district_id, sum(amount) as total, rank() over (
    partition by district_id
    order by sum(amount) desc
  ) position
  from bank.account
  inner join bank.trans
  using (account_id)
  where district_id in (
    select district_id
    from bank.district
    where A3 = 'central Bohemia'
  )
group by account_id
order by district_id desc
) t
where position = 1
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(5228, 77, 5026336.7999687195, 1),
 (1695, 76, 4889808.99997139, 1),
 (3521, 75, 6144985.200019836, 1),
 (7753, 74, 5588708.600379944, 1),
 (2609, 73, 3954908.3000240326, 1)]

In [66]:
%%sql
select * from (
  select account_id, district_id, sum(amount) as total, rank() over (
    partition by district_id
    order by sum(amount) desc
  ) position
  from bank.account
  inner join bank.trans
  using (account_id)
  where district_id in (
    select district_id
    from bank.district
    where A3 = 'central Bohemia'
  )
group by account_id
order by district_id desc
) t
where position = 1
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(5228, 77, 5026336.7999687195, 1),
 (1695, 76, 4889808.99997139, 1),
 (3521, 75, 6144985.200019836, 1),
 (7753, 74, 5588708.600379944, 1),
 (2609, 73, 3954908.3000240326, 1),
 (1605, 72, 5159602.799921036, 1),
 (863, 71, 5286689.700048447, 1),
 (9203, 70, 5531195.300057411, 1),
 (4514, 69, 4988314.600093842, 1),
 (5129, 68, 5933536.100048006, 1)]

In [73]:
%%sql
select district.A2 district_name, account_id, round(total) as total
from (
  select account_id, district_id, sum(amount) as total, rank() over (
    partition by district_id
    order by sum(amount) desc
  ) position
  from bank.account
  inner join bank.trans
  using (account_id)
  group by account_id
) t
inner join district on t.district_id = district.A1
where position = 1
order by district_id
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('Hl.m. Praha', 2486, 6007340.0),
 ('Benesov', 2651, 4126189.0),
 ('Beroun', 2838, 6641140.0),
 ('Kladno', 3558, 5021651.0),
 ('Kolin', 2732, 4631609.0),
 ('Kutna Hora', 485, 4569369.0),
 ('Melnik', 2242, 4576775.0),
 ('Mlada Boleslav', 2959, 4055322.0),
 ('Nymburk', 521, 4537977.0),
 ('Praha - vychod', 7231, 4909705.0)]

## **Lesson 4. - Introduction to nested sub queries with more than one level of nesting.**

Here we are again using **Sample A** to further filter the results based on aggregation on the amount column as can be seen in the query below:

In [76]:
%%sql
select k_symbol from (
  select avg(amount) as mean, k_symbol
  from bank.order
  where bank_to in (
    select bank
    from (
      select bank, avg(amount) as Average
      from bank.trans
      where bank <> ''
      group by bank
      having Average > 5500
    ) sub1
  )
  and k_symbol <> ' '
  group by k_symbol
  having mean > 2000
) sub;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[('UVER',), ('SIPO',), ('LEASING',)]

Here we are again using **Sample B** to further filter the results based on aggregation on the balance column as can be seen in the query below:

In [77]:
%%sql
select avg(balance) as Avg_balance, operation
from bank.trans
where k_symbol in (
  select k_symbol as symbol
  from (
    select avg(amount) as Average, k_symbol
    from bank.order
    where k_symbol <> ' '
    group by k_symbol
    having Average > 3000
    order by Average desc
  ) sub1
)
group by operation;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(35406.31362262612, 'PREVOD NA UCET'), (27806.698449435964, 'VYBER')]

 If we only want the name of the operation that has the higher balance:

In [78]:
%%sql
select operation from (
  select avg(balance) as Avg_balance, operation
  from bank.trans
  where k_symbol in (
    select k_symbol as symbol
    from (
      select avg(amount) as Average, k_symbol
      from bank.order
      where k_symbol <> ' '
      group by k_symbol
      having Average > 3000
      order by Average desc
    ) sub1
  )
  group by operation
) sub2
order by Avg_balance
limit 1;

 * mysql+pymysql://root:***@localhost/bank
1 rows affected.

[('VYBER',)]